{
    "name": "Buisson Reda",
    "hi": "Hi, I'm",
    "im": "I am a",
    "developer": "developer",
    "from": "from",
    "create": "I create",
    "websites": "websites",
    "mobile_apps": "mobile apps",
    "and": "and create different kind of",
    "projects": "projects",
    "projectsHeader": "Projects",
    "why": "I created this site to show my programming career, present the different projects I've made throughout the years, show my programming skills and my workflow!. I hope you'll enjoy it",
    "last": "Last projects",
    "lastArticles": "Last articles",
    "articles": "Articles",
    "first_article_title": "How to make navigation transitions in your Vue.js site",
    "first_article_date": "January 14, 2019",
    "first_article_presentation": "If you're making a Vue.js site and you want to have sweet transitions when you navigate,you're in the right place",
    "first_article_content": "If you're making a Vue.js site and you want to have sweet transitions when you navigate, you're in the right place",
    "first_article_content_2": "Go to your App.vue file, and write this template",
    "first_article_content_3": "Notice the transition component. It's from Vue.js, you don't need a third party library to use it. More info about it",
    "here": "here",
    "first_article_content_4": "In the same file, add this css",
    "first_article_content_5": "You can of course adjust the length of the transition, or change color, or do anything you want",
    "first_article_content_6": "You have now navigation transitions in your Vue.js site",
    "about": "About",
    "hi_2": "Hi, I'm Buisson Réda, I'm a web developer from Toulouse, France",
    "why_2": "I created this site to showcase my programming journey so far",
    "timeline": "Timeline",
    "before": "65 millions B.C",
    "dinosaurs": "Dinosaurs appear on Earth",
    "born": "I was born in Toulouse, France",
    "bac": "I get my bachelor's degree and start studying computer science",
    "dut": "I get a DUT in University Institute of Blagnac, France",
    "shootmania": "I reach the semi-final in a tournament of Shootmania. Video of my performance",
    "blagnac": "I get a Pro License in University Institute of Blagnac, France",
    "job": "I start working for a company named Ze-Watt, specialized in electric mobility",
    "music": "Music",
    "flstudio": "Sometimes, I make music using Fl Studio. Check my",
    "photography": "Photography",
    "take": "I take a lot of pictures. Check my",
    "b2": "How to make your own bash commands in MacOS/linux",
    "date2": "January 15, 2019",
    "pres2": "You want to make your own terminal commands? Here, you will learn to do it in two different ways, in pure Bash, and in Node.js, with perks and cons for each way.",
    "inBash": "In Bash",
    "text2": "First, open the file .bash_profile. You can write functions in it and run them like any other bash commands. For example, write this",
    "anotherText2": "This command first check if there's no argument to it. If this is the case, it does 'cd ..', which make us go back to the previous directoy. Else, if there's an 'int' as argument, it will do 'cd ..' as many times as the argument",
    "anotherText3": "If you're not familiar with bash syntax, you can check this nice",
    "anotherText4": "Save your bash profile, exit the file and run this command",
    "anotherText5": "You're gone to the previous directory, as expected. Now run it with an argument, for example 3",
    "anotherText6": "You're gone to the third previous directory!",
    "inNode": "In Node.js",
    "anotherText7": "In Node.js, we are going to use some third party libraries. Start by installing yarn",
    "yarn": "yarn is a package manager for Javascript",
    "ansi2": "Also install ansiweather, that display the current weather conditions in your terminal, with support for ANSI colors and Unicode symbols",
    "anotherText8": "Let's create a project directory and initialize it as a Node.js application",
    "anotherText9": "Now, create a file named commands.js, and write this",
    "anotherText10": "The code is so straightforward, it almost doesn't need explanation. With the function 'command', we create a command, with parameters inside ",
    "text36": "We can add an optional description of the command. Then in the function 'action', we can do whatever we want. Here, what i'm doing is an 'exec', which will execute a bash command in a temporary shell. So I'll execute the command that display the weather of a particular city, which is",
    "anotherText11": "The exec function takes a function as callback, with 3 parameters: error, stdout, and stderr. stdout is the result of the exec, so we'll just display it.",
    "anotherText12": "commander.js also gives you the possibility to view all of your scripts. To do this, type:",
    "anotherText13": "Another advantage of doing commands in node.js is that it is easier to write code in node than in bash, and you will have more flexibility. However, in node, when you execute the function 'exec', you create a temporary shell that will be deleted after the execution of your command, so you can not do for example 'cd directory', it will do this in bash.",
    "save": "Save this file, and type",
    "symlink": "This will create a symlink from commands.js script to",
    "so": "so you will be able to run this script from any folder",
    "nowT": "Now, type this",
    "weather": "And you should have the weather in Chicago",
    "end2": "You now know how to create your own bash commands!",
    "lastUpdated": "Site updated on",
    "tangram": "Tangram game made in HTML, CSS and the library D3.js",
    "css": "A CSS Framework for building responsive websites with 12-grids system, buttons, colors, and various components",
    "todos": "A simple mobile todos application made with AngularJs & Ionic. Additionnaly you can have friends and send todos to your friends",
    "template": "VueJs template, with various libraries installed such as vue-axios, vue-router, and a clean layout",
    "progressive": "A Progressive Web App template, made with Vue.js and Vuetify"
}