{
    "name": "Buisson Reda",
    "hi": "Salut, je suis",
    "im": "Je suis un",
    "developer": "développeur",
    "from": "de",
    "create": "Je crée des",
    "websites": "sites webs",
    "mobile_apps": "des applications mobiles",
    "and": "et crée différentes sortes de",
    "projects": "projets",
    "projectsHeader": "Projets",
    "why": "J'ai créé ce site pour montrer ma carrière en programmation, présenter les différents projets que j'ai réalisés au fil des années, montrer mes compétences en programmation et mon environnement de travail. J'espère que ça vous plaira !",
    "last": "Derniers projets",
    "lastArticles": "Derniers articles",
    "articles": "Articles",
    "first_article_title": "Comment faire des transitions de navigation dans votre site Vue.js",
    "first_article_date": "14 janvier 2019",
    "first_article_presentation": "Si vous créez un site Vue.js et que vous souhaitez effectuer des transitions fluides lorsque vous naviguez, vous êtes au bon endroit.",
    "first_article_content": "Si vous créez un site Vue.js et que vous souhaitez effectuer de douces transitions lorsque vous naviguez, vous êtes au bon endroit.",
    "first_article_content_2": "Accédez à votre fichier App.vue et écrivez ce modèle.",
    "first_article_content_3": "Notez le composant de transition. Cela vient de Vue.js, vous n'avez pas besoin d'une bibliothèque tierce pour l'utiliser. Plus d'infos à ce sujet",
    "here": "ici",
    "first_article_content_4": "Dans le même fichier, ajouter ce css",
    "first_article_content_5": "Vous pouvez bien sûr ajuster la longueur de la transition, changer de couleur ou faire ce que vous voulez",
    "first_article_content_6": "Vous avez maintenant des transitions de navigation dans votre site Vue.js",
    "about": "À propos",
    "hi_2": "Bonjour, je suis Buisson Réda, je suis un développeur web de Toulouse, en France",
    "why_2": "J'ai créé ce site pour présenter mon parcours de programmation jusqu'à présent",
    "timeline": "Parcours",
    "born": "Je suis né à Toulouse, France",
    "bac": "J'obtiens mon baccalauréat scientifique et commence à étudier l'informatique",
    "dut": "Je reçois un DUT à l'Institut Universitaire de Blagnac, France",
    "shootmania": "J'atteins la demi-finale dans un tournoi de Shootmania. Vidéo de ma performance",
    "blagnac": "Je reçois une licence Pro à l'Institut Universitaire de Blagnac, France",
    "job": "Je commence à travailler pour une société nommée Ze-Watt, spécialisée dans la mobilité électrique",
    "music": "Musique",
    "flstudio": "Parfois, je fais de la musique avec Fl Studio. Jeter un oeil à mon",
    "photography": "Photographie",
    "take": "Je prends beaucoup de photos. Aller voir mon",
    "b2": "Comment créer vos propres commandes bash sous MacOS/linux",
    "date2": "15 janvier 2019",
    "pres2": "Vous voulez faire vos propres commandes de terminal ? Ici, vous apprendrez à le faire de deux manières différentes, en Bash pur et en Node.js, avec des avantages et des inconvénients pour chaque méthode.",
    "inBash": "En Bash",
    "text2": "Commencez par ouvrir le fichier .bash_profile. Vous pouvez y écrire des fonctions et les exécuter comme n'importe quelle autre commande bash. Par exemple, écrivez ceci",
    "anotherText2": "Cette commande vérifie d'abord s'il n'y a pas d'argument. Si tel est le cas, il fait 'cd ..', ce qui nous ramène au répertoire précédent. Sinon, s'il y a un 'int' en argument, il fera 'cd ..'' autant de fois que l'argument",
    "anotherText3": "Si vous n'êtes pas familier avec la syntaxe bash, vous pouvez aller jeter un oeil sur ce",
    "anotherText4": "Enregistrez votre profil bash, quittez le fichier et exécutez cette commande",
    "anotherText5": "Vous êtes allé au répertoire précédent, comme prévu. Maintenant, lancez-le avec un argument, par exemple 3",
    "anotherText6": "Vous êtes allé au troisième répertoire précédent !",
    "inNode": "En Node.js",
    "anotherText7": "Dans Node.js, nous allons utiliser des bibliothèques tierces. Commencez par installer yarn",
    "yarn": "yarn est un package manager pour Javascript",
    "ansi2": "Installez également answeather, qui affiche les conditions météorologiques actuelles dans votre terminal, avec prise en charge des couleurs ANSI et des symboles Unicode.",
    "anotherText8": "Créons un répertoire de projet et initialisons-le en tant qu'application Node.js",
    "anotherText9": "Maintenant, créez un fichier nommé commands.js et écrivez ceci",
    "anotherText10": "Le code est si simple qu'il n'a presque pas besoin d'explication. Avec la fonction 'commande', nous créons une commande, avec des paramètres entre les ",
    "text36": "Nous pouvons ajouter une description facultative de la commande. Ensuite, dans la fonction 'action', nous pouvons faire ce que nous voulons. Ici, ce que je fais est un 'exec', qui exécutera une commande bash dans un shell temporaire. Donc, je vais exécuter la commande qui affiche la météo d'une ville particulière, qui est",
    "anotherText11": "La fonction exec prend une fonction en tant que rappel, avec 3 paramètres: error, stdout et stderr. stdout est le résultat de l'exec, nous allons donc l'afficher.",
    "anotherText12": "commander.js vous offre aussi la possibilité de visualiser l'ensemble de vos scripts. Pour cela, taper : ",
    "anotherText13": "Un autre avantage de faire les commandes en node.js est que c'est plus simple d'écrire du code en node qu'en bash, et vous aurez plus de flexibilité. Par contre, en node, lorsque vous executez la fonction 'exec', vous créez un shell temporaire qui sera supprimé après l'exécution de votre commande, donc vous ne pourrez pas faire par exemple de 'cd directory', il faudra faire cela en bash.",
    "save": "Enregistrez ce fichier et tapez",
    "symlink": "Cela créera un lien symbolique à partir du script commands.js vers",
    "so": "vous pourrez donc exécuter ce script depuis n'importe quel répertoire",
    "nowT": "Maintenant, tapez ceci",
    "weather": "Et vous devriez avoir la météo à Chicago",
    "end2": "Vous savez maintenant comment créer vos propres commandes bash !",
    "project1": "Jeu Tangram créé en HTML, CSS et avec la bibliothèque D3.js",
    "lastUpdated": "Site mise à jour le"
}