{
    "name": "Buisson Reda",
    "hi": "Hola, soy",
    "im": "Soy un",
    "developer": "desarrollador",
    "from": "desde",
    "create": "Yo creo",
    "websites": "sitios web",
    "mobile_apps": "aplicaciones móviles",
    "and": "y crear diferentes tipos de",
    "projects": "proyectos",
    "why": "Creé este sitio para mostrar mi carrera en programación, presentar los diferentes proyectos que he realizado a lo largo de los años, mostrar mis habilidades de programación y mi flujo de trabajo. Espero que lo disfrutes!",
    "last": "Últimos proyectos",
    "lastArticles": "Últimos artículos",
    "articles": "Artículos",
    "first_article_title": "Cómo hacer transiciones de navegación en tu sitio Vue.js",
    "first_article_date": "14 enero 2019",
    "first_article_presentation": "Si estás haciendo un sitio Vue.js y quieres tener transiciones dulces cuando navegas, estás en el lugar correcto",
    "first_article_content": "Si estás haciendo un sitio Vue.js y quieres tener transiciones dulces cuando navegas, estás en el lugar correcto",
    "first_article_content_2": "Ve a tu archivo App.vue y escribe esta plantilla",
    "first_article_content_3": "Note el componente de transición. Es de Vue.js, no necesita una biblioteca de terceros para usarla. Más información al respecto.",
    "here": "aquí",
    "first_article_content_4": "En el mismo archivo, agregue este css.",
    "first_article_content_5": "Por supuesto, puede ajustar la duración de la transición, cambiar el color o hacer lo que quiera",
    "first_article_content_6": "Ahora tiene transiciones de navegación en su sitio Vue.js",
    "about": "Acerca de",
    "hi_2": "Hola, soy Buisson Réda, soy un desarrollador web de Toulouse, Francia",
    "why_2": "He creado este sitio para mostrar mi viaje de programación hasta ahora",
    "timeline": "Curso",
    "before": "65 millones a. C.",
    "dinosaurs": "Aparecen dinosaurios en la tierra",
    "born": "Nací en Toulouse, Francia",
    "bac": "Me gradúo y empiezo a estudiar informática.",
    "dut": "Recibo un DUT en el Instituto Universitario de Blagnac, Francia",
    "shootmania": "Llego a la semifinal en un torneo de Shootmania. Video de mi performance",
    "blagnac": "Obtengo una licencia profesional en el Instituto Universitario de Blagnac, Francia",
    "job": "Empiezo a trabajar para una empresa llamada Ze-Watt, especializada en movilidad eléctrica.",
    "music": "Música",
    "flstudio": "A veces, hago música usando Fl Studio. Revisa mi",
    "photography": "Fotografía",
    "take": "Tomo muchas fotos. Revisa mi",
    "b2": "Cómo hacer tus propios comandos de bash en MacOS/linux",
    "date2": "15 de enero de 2019",
    "pres2": "¿Quieres hacer tus propios comandos de terminal? Aquí, aprenderás a hacerlo de dos maneras diferentes, en Bash puro y en Node.js, con ventajas y desventajas para cada forma.",
    "inBash": "En Bash",
    "text2": "Primero, abra el archivo .bash_profile. Puedes escribir funciones en él y ejecutarlas como cualquier otro comando de bash. Por ejemplo, escribe esto",
    "anotherText2": "Este comando primero verifica si no hay argumento para ello. Si este es el caso, hace 'cd ..', lo que nos hace volver al directoy anterior. De lo contrario, si hay un 'int' como argumento, hará 'cd ..' tantas veces como el argumento",
    "anotherText3": "Si no está familiarizado con la sintaxis de bash, puede verificar esto",
    "anotherText4": "Guarde su perfil de bash, salga del archivo y ejecute este comando",
    "anotherText5": "Se ha ido al directorio anterior, como se esperaba. Ahora ejecútalo con un argumento, por ejemplo 3",
    "anotherText6": "¡Ya has ido al tercer directorio anterior!",
    "inNode": "En Node.js",
    "anotherText7": "En Node.js, vamos a utilizar algunas bibliotecas de terceros. Empieza por instalar yarn",
    "yarn": "Yarn es un gestor de paquetes para Javascript",
    "ansi2": "Instale también ansiweather, que muestra las condiciones climáticas actuales en su terminal, con soporte para colores ANSI y símbolos Unicode",
    "anotherText8": "Vamos a crear un directorio de proyecto e inicializarlo como una aplicación Node.js",
    "anotherText9": "Ahora, crea un archivo llamado commands.js, y escribe esto",
    "anotherText10": "El código es tan sencillo que casi no necesita explicación. Con la función 'command', creamos un comando, con parámetros dentro de ",
    "text36": "Podemos añadir una descripción opcional del comando. Luego, en la función 'action', podemos hacer lo que queramos. Aquí, lo que estoy haciendo es un 'exec', que ejecutará un comando bash en un shell temporal. Así que ejecutaré el comando que muestra el clima de una ciudad en particular, que es",
    "anotherText11": "La función exec toma una función como devolución de llamada, con 3 parámetros: error, stdout y stderr. stdout es el resultado del exec, así que solo lo mostraremos.",
    "anotherText12": "commander.js también te da la posibilidad de ver todos tus scripts. Para hacer esto, escriba:",
    "anotherText13": "Otra ventaja de hacer comandos en node.js es que es más fácil escribir código en node que en bash, y tendrá más flexibilidad. Por contra, en el node, cuando ejecuta la función 'exec', crea un shell temporal que se eliminará después de la ejecución de su comando, por lo que no puede hacer, por ejemplo, 'cd directory', lo hará en bash.",
    "save": "Guarde este archivo y escriba",
    "symlink": "Esto creará un enlace simbólico desde el script de command.js hasta",
    "so": "Así podrás ejecutar este script desde cualquier carpeta.",
    "nowT": "Ahora, escriba esto",
    "weather": "Y deberías tener el clima en Chicago",
    "end2": "¡Ahora sabes cómo crear tus propios comandos de bash!",
    "lastUpdated": "Sitio actualizado en"
  }